In [1]:
#!pip install ipython-sql

In [2]:
%load_ext sql

In [4]:
%sql postgresql://postgres:Speedy3861@localhost:5432/sql-cookbook

In [5]:
%%sql
CREATE TABLE employees();

 * postgresql://postgres:***@localhost:5432/sql-cookbook
Done.

[]

In [6]:
%%sql
DROP TABLE employees;

 * postgresql://postgres:***@localhost:5432/sql-cookbook
Done.

[]

In [10]:
%%sql
CREATE TABLE dept(
    deptno INT PRIMARY KEY,
    dname VARCHAR(20),
    loc VARCHAR(20)
)

 * postgresql://postgres:***@localhost:5432/sql-cookbook
Done.

[]

In [17]:
%%sql

INSERT INTO dept VALUES
    (10, 'ACCOUNTING','NEW YORK'),
    (20, 'RESEARCH','DALLAS'),
    (30, 'SALES', 'CHICAGO'),
    (40, 'OPERATIONS', 'BOSTON');

 * postgresql://postgres:***@localhost:5432/sql-cookbook
4 rows affected.

[]

In [18]:
%%sql
select * from dept

 * postgresql://postgres:***@localhost:5432/sql-cookbook
4 rows affected.

[(10, 'ACCOUNTING', 'NEW YORK'),
 (20, 'RESEARCH', 'DALLAS'),
 (30, 'SALES', 'CHICAGO'),
 (40, 'OPERATIONS', 'BOSTON')]

In [21]:
%%sql
CREATE TABLE employees(
    empno INT PRIMARY KEY,
    ename VARCHAR(50),
    job VARCHAR(30),
    mgr INT,
    hiredate DATE,
    sal INT,
    comm INT,
    deptno INT REFERENCES dept(deptno)
);

 * postgresql://postgres:***@localhost:5432/sql-cookbook
Done.

[]

In [22]:
%%sql
select * from employees;

 * postgresql://postgres:***@localhost:5432/sql-cookbook
0 rows affected.

[]

In [32]:
%%sql
INSERT INTO employees VALUES
    (7369, 'SMITH', 'CLERK', 7902, to_timestamp('17-DEC-2005', 'DD-MON-YYYY'), 800, NULL ,20),
    (7499, 'ALLEN', 'SALESMAN', 7698, to_timestamp('20-FEB-2006', 'DD-MON-YYYY'), 1600, 300, 30),
    (7521, 'WARD', 'SALESMAN', 7698, to_timestamp('22-FEB-2006', 'DD-MON-YYYY'), 1250, 500, 30),
    (7566, 'JONES', 'MANAGER', 7839, to_timestamp('02-APR-2006', 'DD-MON-YYYY'), 2975, NULL, 20),
    (7654, 'MARTIN', 'SALESMAN', 7698, to_timestamp('28-SEP-2006', 'DD-MON-YYYY'), 1250, 1400, 30),
    (7698, 'BLAKE', 'MANAGER', 7839, to_timestamp('01-MAY-2006', 'DD-MON-YYYY'), 2850, NULL, 30),
    (7782, 'CLARK', 'MANAGER', 7839, to_timestamp('09-JUN-2006', 'DD-MON-YYYY'), 2450, NULL, 10),
    (7788, 'SCOTT', 'ANALYST', 7566, to_timestamp('09-DEC-2007', 'DD-MON-YYYY'), 3000, NULL, 20),
    (7839, 'KING', 'PRESIDENT', NULL, to_timestamp('17-NOV-2006', 'DD-MON-YYYY'), 5000, NULL, 10),
    (7844, 'TURNER', 'SALESMAN', 7698, to_timestamp('08-SEP-2006', 'DD-MON-YYYY'), 1500, 0, 30),
    (7876, 'ADAMS', 'CLERK', 7788, to_timestamp('12-JAN-2008', 'DD-MON-YYYY'), 1100, NULL, 20),
    (7900, 'JAMES', 'CLERK', 7698, to_timestamp('03-DEC-2006', 'DD-MON-YYYY'), 950, NULL, 30),
    (7902, 'FORD', 'ANALYST', 7566, to_timestamp('03-DEC-2006', 'DD-MON-YYYY'), 3000, NULL, 20),
    (7934, 'MILLER', 'CLERK', 7782, to_timestamp('23-JAN-2007', 'DD-MON-YYYY'), 1300, NULL, 10);

 * postgresql://postgres:***@localhost:5432/sql-cookbook
14 rows affected.

[]

In [33]:
%%sql
select * from employees

 * postgresql://postgres:***@localhost:5432/sql-cookbook
14 rows affected.

[(7369, 'SMITH', 'CLERK', 7902, datetime.date(2005, 12, 17), 800, None, 20),
 (7499, 'ALLEN', 'SALESMAN', 7698, datetime.date(2006, 2, 20), 1600, 300, 30),
 (7521, 'WARD', 'SALESMAN', 7698, datetime.date(2006, 2, 22), 1250, 500, 30),
 (7566, 'JONES', 'MANAGER', 7839, datetime.date(2006, 4, 2), 2975, None, 20),
 (7654, 'MARTIN', 'SALESMAN', 7698, datetime.date(2006, 9, 28), 1250, 1400, 30),
 (7698, 'BLAKE', 'MANAGER', 7839, datetime.date(2006, 5, 1), 2850, None, 30),
 (7782, 'CLARK', 'MANAGER', 7839, datetime.date(2006, 6, 9), 2450, None, 10),
 (7788, 'SCOTT', 'ANALYST', 7566, datetime.date(2007, 12, 9), 3000, None, 20),
 (7839, 'KING', 'PRESIDENT', None, datetime.date(2006, 11, 17), 5000, None, 10),
 (7844, 'TURNER', 'SALESMAN', 7698, datetime.date(2006, 9, 8), 1500, 0, 30),
 (7876, 'ADAMS', 'CLERK', 7788, datetime.date(2008, 1, 12), 1100, None, 20),
 (7900, 'JAMES', 'CLERK', 7698, datetime.date(2006, 12, 3), 950, None, 30),
 (7902, 'FORD', 'ANALYST', 7566, datetime.date(2006, 12, 3), 3000, None, 20),
 (7934, 'MILLER', 'CLERK', 7782, datetime.date(2007, 1, 23), 1300, None, 10)]